org/topics/terraform.org
:PROPERTIES:
:ID:       06676c92-78a2-4d38-966e-058acdf5cdfd
:END:
#+title: Terraform

* Articles
- 2023-06-20 ◦ [[https://stackoverflow.com/questions/58594506/how-to-for-each-through-a-listobjects-in-terraform-0-12][loops - How to for_each through a list(objects) in Terraform 0.12 - Stack Overflow]]
  #+begin_quote
  Using for_each on a list of strings
  Using for_each on a list of objects
  Using for_each to combine two lists
  Using for_each in a nested block
  Using for_each as a conditional
  #+end_quote
- 2023-06-13 ◦ [[https://spacelift.io/blog/terraform-files][Terraform Files - How to Structure Terraform Project]]
- 2023-06-13 ◦ [[https://xebia.com/blog/four-tips-to-better-structure-terraform-projects/][4 Tips to better structure Terraform projects]]
 Which files:
 #+begin_quote
 - ~provider.tf~: contains the terraform block and provider block
 - ~data.tf~: contains all data sources
 - ~variables.tf:~ contains all defined variables
 - ~locals.tf~: contains all local variables
 - ~output.tf~: contains all output resources
 #+end_quote

 Locals vs variables:
 #+begin_quote
 - *variable blocks*: should be used for values that are not known beforehand, such IDs that are defined at runtime.
 - *Local blocks*: should be used for values that are known beforehand, but are good to abstract as variables, such as constants
 #+end_quote

 Use ~yamldecode~ to load a YAML file with all the settings (instead of defining everything in the TF file)

** AWS
- 2024-03-05 ◦ [[https://aws.amazon.com/blogs/mt/how-to-deploy-aws-config-conformance-packs-using-terraform/][How to Deploy AWS Config Conformance Packs Using Terraform | AWS Cloud Operations & Migrations Blog]]
  - Deploy AWS Config [[https://github.com/awslabs/aws-config-rules/tree/master/aws-config-conformance-packs][conformance packs]] using Terraform
- 2023-08-16 ◦ [[https://aws-ia.github.io/standards-terraform/][The AWS IA Team's best practices for Terraform]]
- 2023-08-02 ◦ [[https://spin.atomicobject.com/2021/04/07/aws-cloudwatch-metric-filter-alarm-terraform/][Create an AWS CloudWatch Metric Filter and Alarm in Terraform]]
** Best Practices
- 2024-04-18 ◦ [[https://cep.dev/posts/every-infrastructure-decision-i-endorse-or-regret-after-4-years-running-infrastructure-at-a-startup/][(Almost) Every infrastructure decision I endorse or regret after 4 years running infrastructure at a startup · Jack's home on the web]]
- 2023-11-14 ◦ [[https://www.reddit.com/r/Terraform/comments/17qkfwm/what_terraform_best_practice_isnt_talked_about/?rdt=34153][What Terraform best practice isn't talked about enough?]]
** Layout
- 2023-10-16 ◦ [[https://community.aws/tutorials/automating-multiple-environments-with-terraform][Community | Automating Multiple Environments with Terraform]]
- 2023-09-19 ◦ [[https://cloud.google.com/docs/terraform/best-practices-for-terraform][Best practices for using Terraform (Google Cloud)]]
- 2023-08-01 ◦ [[https://getbetterdevops.io/terraform-create-infrastructure-in-multiple-environments/][How to Create Terraform Multiple Environments]]
  - separated directors vs workspaces
- 2023-08-01 ◦ [[https://dev.to/aws-builders/how-to-manage-terraform-state-in-aws-1001][How to Manage Terraform State in AWS - DEV Community]]
  - Mentions [[https://developer.hashicorp.com/terraform/language/state/workspaces][workspaces]]
  - Has a good project layout (where each deployment environment gets its own folder)
*** Mono-repo vs multi-repo
- 2023-12-06 ◦ [[https://www.thoughtworks.com/en-de/insights/blog/agile-engineering-practices/monorepo-vs-multirepo][Monorepo vs. multi-repo: Different strategies for organizing repositories | Thoughtworks]]
- 2023-12-06 ◦ [[https://www.hashicorp.com/blog/terraform-mono-repo-vs-multi-repo-the-great-debate][Terraform Mono Repo vs. Multi Repo: The Great Debate]]
** Tagging
- 2023-08-01 ◦ [[https://engineering.deptagency.com/best-practices-for-terraform-aws-tags][Best Practices for Terraform AWS Tags]]
** Testing
- 2024-01-03 ◦ [[https://blog.playgroundtech.io/implementing-unit-and-integration-tests-in-aws-using-terraform-terratest-and-golang-5f92c676ede1][Implementing Unit and integration tests in AWS using Terraform, Terratest, and Golang]]
** Security
- 2023-09-15 ◦ [[https://www.reddit.com/r/devops/comments/10a7j78/terraform_how_do_you_handle_secrets/][Terraform - How do you handle secrets? (r/devops)]]
